Revit 2027 API
TessellatedShapeBuilderResult.Outcome Property
 What kinds of geometrical objects were built.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TessellatedShapeBuilderOutcome Outcome { get; }
Public ReadOnly Property Outcome As TessellatedShapeBuilderOutcome
	Get
public:
property TessellatedShapeBuilderOutcome Outcome {
	TessellatedShapeBuilderOutcome get ();
}
member Outcome : TessellatedShapeBuilderOutcome with get
Property Value
TessellatedShapeBuilderOutcome
See Also
Reference
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace